<!-- add-pr-comment:add-pr-comment -->

##  01-EKS-cluster TF plan on feature branch (Triggered by Mtekdevops)
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # aws_eks_cluster.eks_cluster will be created
  + resource "aws_eks_cluster" "eks_cluster" {
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = [
          + "api",
          + "audit",
          + "authenticator",
          + "controllerManager",
          + "scheduler",
        ]
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + name                      = "it-dev-eks-microservice-demo1"
      + platform_version          = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + tags_all                  = (known after apply)
      + version                   = "1.26"

      + kubernetes_network_config {
          + ip_family         = (known after apply)
          + service_ipv4_cidr = "172.20.0.0/16"
          + service_ipv6_cidr = (known after apply)
        }

      + vpc_config {
          + cluster_security_group_id = (known after apply)
          + endpoint_private_access   = true
          + endpoint_public_access    = true
          + public_access_cidrs       = [
              + "13.66.72.36/32",
            ]
          + subnet_ids                = (known after apply)
          + vpc_id                    = (known after apply)
        }
    }

  # aws_eks_node_group.eks_ng_private will be created
  + resource "aws_eks_node_group" "eks_ng_private" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = "ON_DEMAND"
      + cluster_name           = "it-dev-eks-microservice-demo1"
      + disk_size              = 20
      + id                     = (known after apply)
      + instance_types         = [
          + "t3.small",
        ]
      + node_group_name        = "it-dev-eks-ng-private"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = (known after apply)
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = (known after apply)
      + tags                   = {
          + "Name" = "Private-Node-Group"
        }
      + tags_all               = {
          + "Name" = "Private-Node-Group"
        }
      + version                = (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 2
          + min_size     = 1
        }

      + update_config {
          + max_unavailable = 1
        }
    }

  # aws_iam_openid_connect_provider.oidc_provider will be created
  + resource "aws_iam_openid_connect_provider" "oidc_provider" {
      + arn             = (known after apply)
      + client_id_list  = [
          + "sts.amazonaws.com",
        ]
      + id              = (known after apply)
      + tags            = {
          + "Name"        = "eks-microservice-demo1-eks-irsa"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + tags_all        = {
          + "Name"        = "eks-microservice-demo1-eks-irsa"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + thumbprint_list = [
          + "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ]
      + url             = (known after apply)
    }

  # aws_iam_role.eks_master_role will be created
  + resource "aws_iam_role" "eks_master_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "eks.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "it-dev-eks-master-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.eks_nodegroup_role will be created
  + resource "aws_iam_role" "eks_nodegroup_role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "ec2.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "it-dev-eks-nodegroup-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + role_last_used        = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role_policy_attachment.SSMRoleAttachment1 will be created
  + resource "aws_iam_role_policy_attachment" "SSMRoleAttachment1" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore"
      + role       = "it-dev-eks-nodegroup-role"
    }

  # aws_iam_role_policy_attachment.SSMRoleAttachment2 will be created
  + resource "aws_iam_role_policy_attachment" "SSMRoleAttachment2" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonSSMPatchAssociation"
      + role       = "it-dev-eks-nodegroup-role"
    }

  # aws_iam_role_policy_attachment.eks-AmazonEC2ContainerRegistryReadOnly will be created
  + resource "aws_iam_role_policy_attachment" "eks-AmazonEC2ContainerRegistryReadOnly" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly"
      + role       = "it-dev-eks-nodegroup-role"
    }

  # aws_iam_role_policy_attachment.eks-AmazonEKSClusterPolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks-AmazonEKSClusterPolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSClusterPolicy"
      + role       = "it-dev-eks-master-role"
    }

  # aws_iam_role_policy_attachment.eks-AmazonEKSVPCResourceController will be created
  + resource "aws_iam_role_policy_attachment" "eks-AmazonEKSVPCResourceController" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSVPCResourceController"
      + role       = "it-dev-eks-master-role"
    }

  # aws_iam_role_policy_attachment.eks-AmazonEKSWorkerNodePolicy will be created
  + resource "aws_iam_role_policy_attachment" "eks-AmazonEKSWorkerNodePolicy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy"
      + role       = "it-dev-eks-nodegroup-role"
    }

  # aws_iam_role_policy_attachment.eks-AmazonEKS_CNI_Policy will be created
  + resource "aws_iam_role_policy_attachment" "eks-AmazonEKS_CNI_Policy" {
      + id         = (known after apply)
      + policy_arn = "arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy"
      + role       = "it-dev-eks-nodegroup-role"
    }

  # module.vpc.aws_db_subnet_group.database[0] will be created
  + resource "aws_db_subnet_group" "database" {
      + arn                     = (known after apply)
      + description             = "Database subnet group for it-dev-eks-microservice-demo1"
      + id                      = (known after apply)
      + name                    = "it-dev-eks-microservice-demo1"
      + name_prefix             = (known after apply)
      + subnet_ids              = (known after apply)
      + supported_network_types = (known after apply)
      + tags                    = {
          + "Name"        = "it-dev-eks-microservice-demo1"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + tags_all                = {
          + "Name"        = "it-dev-eks-microservice-demo1"
          + "environment" = "dev"
          + "owners"      = "it"
        }
    }

  # module.vpc.aws_eip.nat[0] will be created
  + resource "aws_eip" "nat" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + carrier_ip           = (known after apply)
      + customer_owned_ip    = (known after apply)
      + domain               = (known after apply)
      + id                   = (known after apply)
      + instance             = (known after apply)
      + network_border_group = (known after apply)
      + network_interface    = (known after apply)
      + private_dns          = (known after apply)
      + private_ip           = (known after apply)
      + public_dns           = (known after apply)
      + public_ip            = (known after apply)
      + public_ipv4_pool     = (known after apply)
      + tags                 = {
          + "Name"        = "it-dev-eks-microservice-demo1-us-east-1a"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + tags_all             = {
          + "Name"        = "it-dev-eks-microservice-demo1-us-east-1a"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + vpc                  = true
    }

  # module.vpc.aws_internet_gateway.this[0] will be created
  + resource "aws_internet_gateway" "this" {
      + arn      = (known after apply)
      + id       = (known after apply)
      + owner_id = (known after apply)
      + tags     = {
          + "Name"        = "it-dev-eks-microservice-demo1"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + tags_all = {
          + "Name"        = "it-dev-eks-microservice-demo1"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + vpc_id   = (known after apply)
    }

  # module.vpc.aws_nat_gateway.this[0] will be created
  + resource "aws_nat_gateway" "this" {
      + allocation_id        = (known after apply)
      + association_id       = (known after apply)
      + connectivity_type    = "public"
      + id                   = (known after apply)
      + network_interface_id = (known after apply)
      + private_ip           = (known after apply)
      + public_ip            = (known after apply)
      + subnet_id            = (known after apply)
      + tags                 = {
          + "Name"        = "it-dev-eks-microservice-demo1-us-east-1a"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + tags_all             = {
          + "Name"        = "it-dev-eks-microservice-demo1-us-east-1a"
          + "environment" = "dev"
          + "owners"      = "it"
        }
    }

  # module.vpc.aws_route.private_nat_gateway[0] will be created
  + resource "aws_route" "private_nat_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + nat_gateway_id         = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route.public_internet_gateway[0] will be created
  + resource "aws_route" "public_internet_gateway" {
      + destination_cidr_block = "0.0.0.0/0"
      + gateway_id             = (known after apply)
      + id                     = (known after apply)
      + instance_id            = (known after apply)
      + instance_owner_id      = (known after apply)
      + network_interface_id   = (known after apply)
      + origin                 = (known after apply)
      + route_table_id         = (known after apply)
      + state                  = (known after apply)

      + timeouts {
          + create = "5m"
        }
    }

  # module.vpc.aws_route_table.database[0] will be created
  + resource "aws_route_table" "database" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "it-dev-eks-microservice-demo1-db"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + tags_all         = {
          + "Name"        = "it-dev-eks-microservice-demo1-db"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.private[0] will be created
  + resource "aws_route_table" "private" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "it-dev-eks-microservice-demo1-private"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + tags_all         = {
          + "Name"        = "it-dev-eks-microservice-demo1-private"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table.public[0] will be created
  + resource "aws_route_table" "public" {
      + arn              = (known after apply)
      + id               = (known after apply)
      + owner_id         = (known after apply)
      + propagating_vgws = (known after apply)
      + route            = (known after apply)
      + tags             = {
          + "Name"        = "it-dev-eks-microservice-demo1-public"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + tags_all         = {
          + "Name"        = "it-dev-eks-microservice-demo1-public"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + vpc_id           = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[0] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.database[1] will be created
  + resource "aws_route_table_association" "database" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[0] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.private[1] will be created
  + resource "aws_route_table_association" "private" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[0] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_route_table_association.public[1] will be created
  + resource "aws_route_table_association" "public" {
      + id             = (known after apply)
      + route_table_id = (known after apply)
      + subnet_id      = (known after apply)
    }

  # module.vpc.aws_subnet.database[0] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.151.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "it-dev-eks-microservice-demo1-db-us-east-1a"
          + "Type"        = "database-subnets"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + tags_all                                       = {
          + "Name"        = "it-dev-eks-microservice-demo1-db-us-east-1a"
          + "Type"        = "database-subnets"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.database[1] will be created
  + resource "aws_subnet" "database" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.152.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"        = "it-dev-eks-microservice-demo1-db-us-east-1b"
          + "Type"        = "database-subnets"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + tags_all                                       = {
          + "Name"        = "it-dev-eks-microservice-demo1-db-us-east-1b"
          + "Type"        = "database-subnets"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[0] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.1.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                                = "it-dev-eks-microservice-demo1-private-us-east-1a"
          + "Type"                                                = "private-subnets"
          + "environment"                                         = "dev"
          + "kubernetes.io/cluster/it-dev-eks-microservice-demo1" = "shared"
          + "kubernetes.io/role/internal-elb"                     = "1"
          + "owners"                                              = "it"
        }
      + tags_all                                       = {
          + "Name"                                                = "it-dev-eks-microservice-demo1-private-us-east-1a"
          + "Type"                                                = "private-subnets"
          + "environment"                                         = "dev"
          + "kubernetes.io/cluster/it-dev-eks-microservice-demo1" = "shared"
          + "kubernetes.io/role/internal-elb"                     = "1"
          + "owners"                                              = "it"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.private[1] will be created
  + resource "aws_subnet" "private" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.2.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = false
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                                = "it-dev-eks-microservice-demo1-private-us-east-1b"
          + "Type"                                                = "private-subnets"
          + "environment"                                         = "dev"
          + "kubernetes.io/cluster/it-dev-eks-microservice-demo1" = "shared"
          + "kubernetes.io/role/internal-elb"                     = "1"
          + "owners"                                              = "it"
        }
      + tags_all                                       = {
          + "Name"                                                = "it-dev-eks-microservice-demo1-private-us-east-1b"
          + "Type"                                                = "private-subnets"
          + "environment"                                         = "dev"
          + "kubernetes.io/cluster/it-dev-eks-microservice-demo1" = "shared"
          + "kubernetes.io/role/internal-elb"                     = "1"
          + "owners"                                              = "it"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[0] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1a"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.101.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                                = "it-dev-eks-microservice-demo1-public-us-east-1a"
          + "Type"                                                = "Public Subnets"
          + "environment"                                         = "dev"
          + "kubernetes.io/cluster/it-dev-eks-microservice-demo1" = "shared"
          + "kubernetes.io/role/elb"                              = "1"
          + "owners"                                              = "it"
        }
      + tags_all                                       = {
          + "Name"                                                = "it-dev-eks-microservice-demo1-public-us-east-1a"
          + "Type"                                                = "Public Subnets"
          + "environment"                                         = "dev"
          + "kubernetes.io/cluster/it-dev-eks-microservice-demo1" = "shared"
          + "kubernetes.io/role/elb"                              = "1"
          + "owners"                                              = "it"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_subnet.public[1] will be created
  + resource "aws_subnet" "public" {
      + arn                                            = (known after apply)
      + assign_ipv6_address_on_creation                = false
      + availability_zone                              = "us-east-1b"
      + availability_zone_id                           = (known after apply)
      + cidr_block                                     = "10.0.102.0/24"
      + enable_dns64                                   = false
      + enable_resource_name_dns_a_record_on_launch    = false
      + enable_resource_name_dns_aaaa_record_on_launch = false
      + id                                             = (known after apply)
      + ipv6_cidr_block_association_id                 = (known after apply)
      + ipv6_native                                    = false
      + map_public_ip_on_launch                        = true
      + owner_id                                       = (known after apply)
      + private_dns_hostname_type_on_launch            = (known after apply)
      + tags                                           = {
          + "Name"                                                = "it-dev-eks-microservice-demo1-public-us-east-1b"
          + "Type"                                                = "Public Subnets"
          + "environment"                                         = "dev"
          + "kubernetes.io/cluster/it-dev-eks-microservice-demo1" = "shared"
          + "kubernetes.io/role/elb"                              = "1"
          + "owners"                                              = "it"
        }
      + tags_all                                       = {
          + "Name"                                                = "it-dev-eks-microservice-demo1-public-us-east-1b"
          + "Type"                                                = "Public Subnets"
          + "environment"                                         = "dev"
          + "kubernetes.io/cluster/it-dev-eks-microservice-demo1" = "shared"
          + "kubernetes.io/role/elb"                              = "1"
          + "owners"                                              = "it"
        }
      + vpc_id                                         = (known after apply)
    }

  # module.vpc.aws_vpc.this[0] will be created
  + resource "aws_vpc" "this" {
      + arn                                  = (known after apply)
      + assign_generated_ipv6_cidr_block     = false
      + cidr_block                           = "10.0.0.0/16"
      + default_network_acl_id               = (known after apply)
      + default_route_table_id               = (known after apply)
      + default_security_group_id            = (known after apply)
      + dhcp_options_id                      = (known after apply)
      + enable_classiclink                   = (known after apply)
      + enable_classiclink_dns_support       = (known after apply)
      + enable_dns_hostnames                 = true
      + enable_dns_support                   = true
      + enable_network_address_usage_metrics = (known after apply)
      + id                                   = (known after apply)
      + instance_tenancy                     = "default"
      + ipv6_association_id                  = (known after apply)
      + ipv6_cidr_block                      = (known after apply)
      + ipv6_cidr_block_network_border_group = (known after apply)
      + main_route_table_id                  = (known after apply)
      + owner_id                             = (known after apply)
      + tags                                 = {
          + "Name"        = "it-dev-eks-microservice-demo1"
          + "environment" = "dev"
          + "owners"      = "it"
        }
      + tags_all                             = {
          + "Name"        = "it-dev-eks-microservice-demo1"
          + "environment" = "dev"
          + "owners"      = "it"
        }
    }

Plan: 34 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + aws_iam_openid_connect_provider_arn              = (known after apply)
  + aws_iam_openid_connect_provider_extract_from_arn = (known after apply)
  + azs                                              = [
      + "us-east-1a",
      + "us-east-1b",
      + "us-east-1c",
      + "us-east-1d",
      + "us-east-1e",
      + "us-east-1f",
    ]
  + cluster_arn                                      = (known after apply)
  + cluster_certificate_authority_data               = (known after apply)
  + cluster_endpoint                                 = (known after apply)
  + cluster_iam_role_arn                             = (known after apply)
  + cluster_iam_role_name                            = "it-dev-eks-master-role"
  + cluster_id                                       = (known after apply)
  + cluster_oidc_issuer_url                          = (known after apply)
  + cluster_primary_security_group_id                = (known after apply)
  + cluster_version                                  = "1.26"
  + nat_public_ips                                   = [
      + null,
    ]
  + node_group_private_arn                           = (known after apply)
  + node_group_private_id                            = (known after apply)
  + node_group_private_status                        = (known after apply)
  + node_group_private_version                       = (known after apply)
  + private_subnets                                  = [
      + null,
      + null,
    ]
  + public_subnets                                   = [
      + null,
      + null,
    ]
  + vpc_cidr_block                                   = "10.0.0.0/16"
  + vpc_id                                           = (known after apply)

```